//======================================================================
//
// Time-stamp: <2012-12-20 14:01:46  Shisheng.Zhi, 0354>
//
// 每个功能码的相关属性
//
//======================================================================


//-------------------------------------------------
// 这段说明有错误
//
// 之后增加功能码，需要的EEPROM地址请使用：
// 1、每组功能码中的预留空间。
// 2、238-260，共23个
// 3、950-1007，

// EEPROM地址的分配：
// 0    - 15，  共16个，保留不使用
// 16   - 1031，共1016个，使用。
// 1032 - 2047，共1026个，备份。

// 238-260，共23个，预留。
// 830-889，共60个，这块EEPROM区间给 故障记录 使用
// 890-949，共60个，这块EEPROM区间给 掉电记忆 使用
//-------------------------------------------------

#include "f_funcCode.h"
#include "f_io.h"
#include "f_main.h"
#include "f_runSrc.h"
#include "f_frqSrc.h"


#if F_DEBUG_RAM
#pragma DATA_SECTION(funcCode, "data_ram");
#endif
FUNCCODE_ALL funcCode;



#if DEBUG_F_POSITION_CTRL
#pragma DATA_SECTION(funcCodeGradeCurMenuMode, "data_ram");
#endif
// 当前菜单模式下，对每一group，用户可以操作的grade个数。
// 为0，表示不可访问该组功能码。
Uint16 funcCodeGradeCurMenuMode[FUNCCODE_GROUP_NUM];
const Uint16 funcCodeGradeAll[FUNCCODE_GROUP_NUM] =
{
//===========================
    F0NUM - 0,  F1NUM - 0,  F2NUM - 0,  F3NUM - 0,  // F0-F3
    F4NUM - 0,  F5NUM - 0,  F6NUM - 0,  F7NUM - 0,  // F4-F7
    F8NUM - 0,  F9NUM - 0,  FANUM - 0,  FBNUM - 0,  // F8-FB
    FCNUM - 0,  FDNUM - 0,  FENUM - 2,  FFNUM - 0,  // FC-FF

//===========================
    FPNUM - 1,                                      // FP

//===========================
    A0NUM - 0,  A1NUM - 0,  A2NUM - 0,  A3NUM - 0,  // A0-A3
    A4NUM - 0,  A5NUM - 0,  A6NUM - 0,  A7NUM - 2,  // A4-A7
    A8NUM - 0,  A9NUM - 15, AANUM - 1,  ABNUM - 1,  // A8-AB
    ACNUM - 0,  ADNUM - 1,  0,          AFNUM - 1,  // AC-AF

//===========================
    B0NUM - 1,  B1NUM - 1,  B2NUM - 1,  B3NUM - 1,  // B0-B3
    B4NUM - 1,  B5NUM - 1,  B6NUM - 1,  B7NUM - 1,  // B4-B7
    B8NUM - 1,  B9NUM - 1,  BANUM - 1,  BBNUM - 1,  // B8-BB
    BCNUM - 1,  BDNUM - 1,  BENUM - 1,  BFNUM - 1,  // BC-BF

//===========================
    C0NUM -	1,  C1NUM - 1,  C2NUM - 1,  C3NUM - 1,  // C0-C3
    C4NUM - 1,  C5NUM - 1,  C6NUM - 1,  C7NUM - 1,  // C4-C7
    C8NUM - 1,  C9NUM - 1,  CANUM - 1,  CBNUM - 1,  // C8-CB
    CCNUM - 1,  CDNUM - 1,  CENUM - 1,  0,          // CC-CF

//===========================
    0,      //  eepromCheckWord

//===========================
    0,      //  掉电记忆

//===========================
    U0NUM -31, U1NUM - 1, U2NUM - 1, U3NUM - 0,     // U0, 显示
    U4NUM - 1, U5NUM - 1, U6NUM - 1, U7NUM - 1,
    U8NUM - 1, U9NUM - 1, UANUM - 1, UBNUM - 1,
    UCNUM - 1, UDNUM - 1, UENUM - 1, 0,
};

// 每一group的开始功能码的index
// 对每一功能码，currentIndex = GetGradeIndex(group, grade) = funcCodeGradeSum[group]+grade;
const Uint16 funcCodeGradeSum[FUNCCODE_GROUP_NUM] =
{
//============================================
    GetCodeIndex(funcCode.group.f0[0]),         // F0
    GetCodeIndex(funcCode.group.f1[0]),         // F1
    GetCodeIndex(funcCode.group.f2[0]),         // F2
    GetCodeIndex(funcCode.group.f3[0]),         // F3

    GetCodeIndex(funcCode.group.f4[0]),         // F4
    GetCodeIndex(funcCode.group.f5[0]),         // F5
    GetCodeIndex(funcCode.group.f6[0]),         // F6
    GetCodeIndex(funcCode.group.f7[0]),         // F7

    GetCodeIndex(funcCode.group.f8[0]),         // F8
    GetCodeIndex(funcCode.group.f9[0]),         // F9
    GetCodeIndex(funcCode.group.fa[0]),         // FA
    GetCodeIndex(funcCode.group.fb[0]),         // FB

    GetCodeIndex(funcCode.group.fc[0]),         // FC
    GetCodeIndex(funcCode.group.fd[0]),         // FD
    GetCodeIndex(funcCode.group.fe[0]),         // FE
    GetCodeIndex(funcCode.group.ff[0]),         // FF

//============================================
    GetCodeIndex(funcCode.group.fp[0]),         // FP

//============================================
    GetCodeIndex(funcCode.group.a0[0]),         // A0
    GetCodeIndex(funcCode.group.a1[0]),         // A1
    GetCodeIndex(funcCode.group.a2[0]),         // A2
    GetCodeIndex(funcCode.group.a3[0]),         // A3

    GetCodeIndex(funcCode.group.a4[0]),         // A4
    GetCodeIndex(funcCode.group.a5[0]),         // A5
    GetCodeIndex(funcCode.group.a6[0]),         // A6
    GetCodeIndex(funcCode.group.a7[0]),         // A7

    GetCodeIndex(funcCode.group.a8[0]),         // A8
    GetCodeIndex(funcCode.group.a9[0]),         // A9
    GetCodeIndex(funcCode.group.aa[0]),         // AA
    GetCodeIndex(funcCode.group.ab[0]),         // AB

    GetCodeIndex(funcCode.group.ac[0]),         // AC
    GetCodeIndex(funcCode.group.ad[0]),         // AD
    GetCodeIndex(funcCode.group.ae[0]),         // AE
    GetCodeIndex(funcCode.group.af[0]),         // AF

//============================================
    GetCodeIndex(funcCode.group.b0[0]),         // B0
    GetCodeIndex(funcCode.group.b1[0]),         // B1
    GetCodeIndex(funcCode.group.b2[0]),         // B2
    GetCodeIndex(funcCode.group.b3[0]),         // B3

    GetCodeIndex(funcCode.group.b4[0]),         // B4
    GetCodeIndex(funcCode.group.b5[0]),         // B5
    GetCodeIndex(funcCode.group.b6[0]),         // B6
    GetCodeIndex(funcCode.group.b7[0]),         // B7

    GetCodeIndex(funcCode.group.b8[0]),         // B8
    GetCodeIndex(funcCode.group.b9[0]),         // B9
    GetCodeIndex(funcCode.group.ba[0]),         // BA
    GetCodeIndex(funcCode.group.bb[0]),         // BB

    GetCodeIndex(funcCode.group.bc[0]),         // BC
    GetCodeIndex(funcCode.group.bd[0]),         // BD
    GetCodeIndex(funcCode.group.be[0]),         // BE
    GetCodeIndex(funcCode.group.bf[0]),         // BF

//============================================
    GetCodeIndex(funcCode.group.c0[0]),         // C0
    GetCodeIndex(funcCode.group.c1[0]),         // C1
    GetCodeIndex(funcCode.group.c2[0]),         // C2
    GetCodeIndex(funcCode.group.c3[0]),         // C3

    GetCodeIndex(funcCode.group.c4[0]),         // C4
    GetCodeIndex(funcCode.group.c5[0]),         // C5
    GetCodeIndex(funcCode.group.c6[0]),         // C6
    GetCodeIndex(funcCode.group.c7[0]),         // C7

    GetCodeIndex(funcCode.group.c8[0]),         // C8
    GetCodeIndex(funcCode.group.c9[0]),         // C9
    GetCodeIndex(funcCode.group.ca[0]),         // CA
    GetCodeIndex(funcCode.group.cb[0]),         // CB

    GetCodeIndex(funcCode.group.cc[0]),         // CC
    GetCodeIndex(funcCode.group.cd[0]),         // CD
    GetCodeIndex(funcCode.group.ce[0]),         // CE
    GetCodeIndex(funcCode.group.cf[0]),         // CF

//============================================
    GetCodeIndex(funcCode.group.fChk[0]),       // eepromCheckWord

//============================================
    GetCodeIndex(funcCode.group.remember[0]),   // 掉电记忆

//============================================
    GetCodeIndex(funcCode.group.u0[0]),         // U0
    GetCodeIndex(funcCode.group.u1[0]),         // U1
    GetCodeIndex(funcCode.group.u2[0]),         // U2
    GetCodeIndex(funcCode.group.u3[0]),         // U3

    GetCodeIndex(funcCode.group.u4[0]),         // U4
    GetCodeIndex(funcCode.group.u5[0]),         // U5
    GetCodeIndex(funcCode.group.u6[0]),         // U6
    GetCodeIndex(funcCode.group.u7[0]),         // U7

    GetCodeIndex(funcCode.group.u8[0]),         // U8
    GetCodeIndex(funcCode.group.u9[0]),         // U9
    GetCodeIndex(funcCode.group.ua[0]),         // UA
    GetCodeIndex(funcCode.group.ub[0]),         // UB

    GetCodeIndex(funcCode.group.uc[0]),         // UC
    GetCodeIndex(funcCode.group.ud[0]),         // UD
    GetCodeIndex(funcCode.group.ue[0]),         // UE
    GetCodeIndex(funcCode.group.uf[0]),         // UF
};


// 功能码的属性表，上限、下限、属性。
// 不包括 (EEPROM_CHK、掉电记忆、)显示
const FUNCCODE_ATTRIBUTE funcCodeAttribute[FNUM_PARA] =
{
//  F0 下限             F0 上限             F0 出厂值       F0 属性 F0-EEPROM地址
{   1,                  2,                  1,              0x1040, 804 ,           },
{   0,                  2,                  0,              0x0840, 805 ,           },
{   0,                  2,                  0,              0x0040, 380 ,           },
{   0,                  9,                  0,              0x0840, 921 ,           },
{   0,                  9,                  0,              0x0840, 4   ,           },
{   0,                  1,                  0,              0x0040, 5   ,           },  // 5
{   0,                  150,                100,            0x00F0, 6   ,           },  // 改为150%
{   0,                  34,                0,               0x4080, 7   ,           },  
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 8   ,           },  
{   0,                  1,                  0,              0x0040, 9   ,           },  
{   500,                32000,              5000,           0x094A, 10  ,           },  // 10
{   0,                  5,                  0,              0x0840, 11  ,           },  
{   LOWER_FRQ_INDEX,    MAX_FRQ_INDEX,      5000,           0x074A, 12  ,           },  
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 13  ,           },  
{   0,                  UPPER_FRQ_INDEX,    0,              0x034A, 14  ,           },  
{   5,                  160,                60,             0x00C1, 15  ,           },  // 15
{   0,                  1,                  1,              0x0040, 806 ,           },
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 807 ,           },  // 6500s
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 808 ,           },
{   0,                  2,                  1,              0x0840, 809 ,           },
{   0,                  8,                  0,              0x1140, 810 ,           },  // 20
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 811 ,           },  //
{   1,                  2,                  2,              0x0840, 812 ,           },  
{   0,                  0x1 ,               0,              0x0040, 813 ,           },  // F0-23   数值设定频率记忆设定
{   0,                  3,                  0,              0x0840, 814 ,           },  
{   0,                  2,                  0,              0x0840, 700 ,           },  // 25 加减速时间基准频率
{   0,                  1,                  0,              0x0840, 701 ,           },  // 26 运行时UP/DN频率基准
{   0,                  9999,               0,              0x4040, 815 ,           },  // 27    
{   0,                  2,                  0,              0x0040, 362 ,           },  // 28
//  F1 下限             F1 上限             F1 出厂值       F1 属性 F1-EEPROM地址
// 电机基本参数
{   0,                  2,                  0,              0x0840, 816 ,           },  // 0
{   1,                  10000,              37,             0x0941, 817 ,           },
{   1,                  2000,               380,            0x08E0, 818 ,           },
{   1,                  65535,              900,            0x0952, 819 ,           },
{   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 820 ,           },
{   1,                  65535,              1460,           0x0958, 821 ,           },  // 5
// 异步机调谐参数
{   1,                  65535,              1204,           0x0943, 822 ,           },  // 6  异步机定子电阻
{   1,                  65535,              908,            0x0943, 823 ,           },
{   1,                  65535,              528,            0x0942, 824 ,           },
{   1,                  65535,              1586,           0x0941, 825 ,           },
{   1,                  RATING_CUR_INDEX,   424,            0x0B52, 826 ,           },  // 10 空载电流
{   0,                  65535,              0,              0x1140, 827 ,           },  // 11 保留
{   0,                  65535,              0,              0x1140, 828 ,           },  // 12 保留
{   0,                  65535,              0,              0x1140, 829 ,           },  // 13 保留
{   0,                  65535,              0,              0x1140, 830 ,           },  // 14 保留
{   0,                  65535,              0,              0x1140, 922 ,           },  // 15 保留

// 同步机调谐参数
{   1,                  65535,              1204,           0x0943, 923 ,           },  // 16 同步机定子电阻
{   1,                  65535,              1586,           0x0942, 924 ,           },  // 17 
{   1,                  65535,              1586,           0x0942, 925 ,           },  // 18
{   0,                  12   ,                 0,           0x1180, 926 ,           },  // 19 同步电机电阻、电感单位
{   0,                  65535,              3000,           0x0961, 927 ,           },  // 20 同步机反电动势系数	0~6000.0V	
{   0,                  60000,                 0,           0x1943, 928 ,           },  // 21 同步机输出缺相检测时间
{   0,                  65535,              0,              0x1140, 929 ,           },  // 22 保留
{   0,                  65535,              0,              0x1140, 930 ,           },  // 23 保留
{   0,                  65535,              0,              0x1140, 931 ,           },  // 24 保留
{   0,                  65535,              0,              0x1140, 932 ,           },  // 25 保留
{   0,                  65535,              0,              0x1140, 933 ,           },  // 26 保留
// PG卡参数
{   1,                  65535,              2500,           0x0940, 75  ,           },  // 0
{   0,                      4,              0,              0x0940, 399 ,           },  // 1
{   0,                      2,              0,              0x0940, 400 ,           },  // 2
{   0,                      1,              0,              0x0840, 405 ,           },  // 3 旋变方向
{   0,                   3599,              0,              0x0901, 401 ,           },  // 4 编码器安装位置角
{   0,                      1,              0,              0x0840, 76  ,           },  // 5 UVW信号方向
{   0,                   3599,              0,              0x0901, 596,            },  // 6 UVW信号零点位置角
{   1,                  65535,              1,              0x0940, 406 ,           },  // 7 旋变极对数
{   1,                  65535,              4,              0x1140, 407 ,           },  // 8 UVW极对数
{   0,                    100,              0,              0x08C1, 77  ,           },  // 9 速度反馈PG断线检测时间
// 调谐
{   0,                  12,                 0,              0x0840, 937 ,           },  // 27 调谐选择

//  F2 下限             F2 上限             F2 出厂值       F2 属性 F2-EEPROM地址
{   1,                  100,                30,             0x00C0, 938 ,           },  // F2-00
{   1,                  1000,               50,             0x0102, 939 ,           },  // F2-01
{   0,                  VC_CHG_FRQ2_INDEX,  500,            0x034A, 940 ,           },  // F2-02
{   1,                  100,                20,             0x00C0, 941 ,           },  // F2-03
{   1,                  1000,               100,            0x0102, 942 ,           },  // F2-04
{   VC_CHG_FRQ1_INDEX,  MAX_FRQ_INDEX,      1000,           0x074A, 943 ,           },  // F2-05
{   50,                 200,                100,            0x00F0, 944 ,           },  // F2-06
{   0,                  100,                0,              0x0103, 64  ,           },  // F2-07
{   0,                  200,                64,             0x00C0, 65  ,           },  // F2-08
{   0,                  7,                  0,              0x0040, 66  ,           },  // F2-09
{   0,                  2000,               1500,           0x0131, 67  ,           },  // F2-10
{   0,                  8,                  0,              0x1040, 68  ,           },  // F2-11
{   0,                  2000,               0,              0x1131, 69  ,           },  // F2-12
{   0,                  60000,              2000,           0x0140, 70  ,           },  // F2-13 
{   0,                  60000,              1300,           0x0140, 71  ,           },  // F2-14
{   0,                  60000,              2000,           0x0140, 72  ,           },  // F2-15
{   0,                  60000,              1300,           0x0140, 73  ,           },  // F2-16
{   0,                     1,               0,              0x4080, 74  ,           },  // F2-17 
{   0,                      2,              1,              0x0040, 935 ,           },  // F2-18
{   50,                   500,              100,            0x00F0, 936 ,           },  // F2-19
{   1,                    300,               50,            0x08F0, 597,            },  // F2-20
{   10,                   500,              100,            0x00F0, 598,            },  // F2-21
{   2,                     10,                2,            0x0080, 599,            },  // F2-22
//  F3 下限             F3 上限             F3 出厂值       F3 属性 F3-EEPROM地址
{   0,                  11,                 0,              0x0840, 78  ,           },  // 0
{   0,                  300,                10,             0x00F1, 79  ,           },
{   0,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 80  ,           },
{   0,                  VF_FRQ2_INDEX,      0,              0x0B4A, 81  ,           },  // F3-03   多点VF频率点1
{   0,                  1000,               0,              0x0931, 82  ,           },  
{   VF_FRQ1_INDEX,      VF_FRQ3_INDEX,      0,              0x0F4A, 83  ,           },  // F3-05   多点VF频率点2
{   0,                  1000,               0,              0x0931, 84  ,           },  
{   VF_FRQ2_INDEX,      RATING_FRQ_INDEX,   0,              0x0F4A, 85  ,           },  // F3-07   多点VF频率点3
{   0,                  1000,               0,              0x0931, 86  ,           },  
{   0,                  2000,               0,              0x0131, 87  ,           },  
{   0,                  200,                64,             0x00C0, 88  ,           },  // F3-10   过励磁增益
{   0,                  100,                0,              0x00C0, 89  ,           },  
{   0,                    11,               0,              0x5040, 90  ,           },  // F3-12  振荡抑制模式选择
{   0,                  8,                  0,              0x0040, 91  ,           },  
{   0,                  RATING_VOL_INDEX,   0,              0x0360, 92  ,           },  //
{   0,                  10000,              0,              0x0141, 93  ,           },  //
                                                                        
//  F4 下限             F4 上限             F4 出厂值       F4 属性 F4-EEPROM地址     
{   0,                  DI_FUNC_NUMBER-1,   1,              0x0880, 94  ,           },  // 0
{   0,                  DI_FUNC_NUMBER-1,   4,              0x0880, 95  ,           },  
{   0,                  DI_FUNC_NUMBER-1,   9,              0x0880, 96  ,           },  
{   0,                  DI_FUNC_NUMBER-1,   12,             0x0880, 97  ,           },  
{   0,                  DI_FUNC_NUMBER-1,   13,             0x0880, 98  ,           },  
{   0,                  DI_FUNC_NUMBER-1,   2,              0x0880, 99  ,           },  // 5
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 100 ,           },  
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 101 ,           },  
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 102 ,           },  
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 103 ,           },  
{   0,                  1000,               10,             0x0083, 104 ,           },  // 10
{   0,                  3,                  0,              0x0840, 105 ,           },  
{   1,                  65535,              1000,           0x014B, 106 ,           },  
{   0,                  CURVE1_MAX_INDEX,   0,              0x2322, 107 ,           },  // 13 曲线1最小输入
{   (Uint16)(-1000),    1000,               0,              0x2131, 108 ,           },  
{   CURVE1_MIN_INDEX,   1000,               1000,           0x2522, 109 ,           },  
{   (Uint16)(-1000),    1000,               1000,           0x2131, 110 ,           },  
{   0,                  1000,               10,             0x0102, 111 ,           },  // F4-17   AI1滤波时间
{   0,                  CURVE2_MAX_INDEX,   0,              0x2322, 112 ,           },  // 18 曲线2最小输入
{   (Uint16)(-1000),    1000,               0,              0x2131, 113 ,           },  
{   CURVE2_MIN_INDEX,   1000,               1000,           0x2522, 114 ,           },  
{   (Uint16)(-1000),    1000,               1000,           0x2131, 115 ,           },  
{   0,                  1000,               10,             0x0102, 116 ,           },  // F4-22   AI2滤波时间
{   (Uint16)(-1000),    CURVE3_MAX_INDEX,   10  ,            0x2322, 117 ,          },  // 23 曲线3最小输入
{   (Uint16)(-1000),    1000,               0   ,           0x2131, 118 ,           },  
{   CURVE3_MIN_INDEX,   1000,               400   ,         0x2522, 119 ,           },  
{   (Uint16)(-1000),    1000,               1000 ,         0x2131, 120 ,           },  
{   0,                  1000,               10,             0x0102, 121 ,           },  // F4-27   AI3滤波时间
{   0        ,          PULSE_IN_MAX_INDEX, 0,              0x0302, 122 ,           },  // F4-28   PULSE最小输入
{   0xFC18   ,          1000 ,              0,              0x2131, 123 ,           },  // F4-29   PULSE最小输入对应设定
{   PULSE_IN_MIN_INDEX, 10000,              5000,           0x0502, 124 ,           },  // F4-30   PULSE最大输入
{   0xFC18   ,          1000 ,              1000,           0x2131, 125 ,           },  // F4-31   PULSE最大输入设定
{   0        ,          1000 ,              10,             0x0102, 126 ,           },  // F4-32   PULSE滤波时间
{   0x0111,             0x0555,             0x0321,         0x8140, 127 ,           },  // F4-33   AI设定曲线选择
// start ADD
{   0x0000,             0x0111,             0x0000,         0x80B0, 702 ,           },  // F4-34   AI设定曲线选择
// end
{   0,                  36000,              0,              0x0141, 128 ,           },  // F4-35   DI1延迟时间
{   0,                  36000,              0,              0x0141, 129 ,           },  
{   0,                  36000,              0,              0x0141, 130 ,           },  
{   0,                  11111,              0,              0x4940, 131 ,           },  // F4-38
{   0,                  11111,              0,              0x4940, 132 ,           },  // F4-39

//  F5 下限             F5 上限             F5 出厂值       F5 属性 F5-EEPROM地址
{   0,         FUNCCODE_FM_OUT_SELECT_MAX,  0,              0x0040, 133 ,           },  // 0
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 134 ,           },  
{   0,                  (DO_FUNC_NUMBER-1), 2,              0x0080, 135 ,           },  
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 136 ,           },  
{   0,                  (DO_FUNC_NUMBER-1), 1,              0x0080, 137 ,           },  
{   0,                  (DO_FUNC_NUMBER-1), 4,              0x0080, 138 ,           },  // 5
{   0,                  16,                 0,              0x0080, 139 ,           },  
{   0,                  16,                 0,              0x0080, 140 ,           },  
{   0,                  16,                 1,              0x0080, 141 ,           },  
{   1,                  10000,              5000,           0x00C2, 142 ,           },  
{   0xFC18,             1000,               0,              0x2131, 143 ,           },  // 10
{   0xFC18,             1000,               100,            0x2102, 144 ,           },
{   0xFC18,             1000,               0,              0x2131, 145 ,           },
{   0xFC18,             1000,               100,            0x2102, 146 ,           },
{   0,                  1000,               0,              0x1102, 147 ,           },  // F5-14   AO1

{   0,                  1000,               0,              0x1102, 148 ,           },  // F5-15   AO2滤波时间
{   0,                  1000,               0,              0x1102, 149 ,           },  // F5-16   HDO滤波时间
{   0,                  36000,              0,              0x0141, 150 ,           },  // F5-17   realy1输出延迟时间，0.1s
{   0,                  36000,              0,              0x0141, 151 ,           },  // F5-18   realy2输出延迟时间，0.1s
{   0,                  36000,              0,              0x0141, 152 ,           },  // F5-19   DO1输出延迟时间
{   0,                  36000,              0,              0x0141, 153 ,           },  // F5-20   DO2输出延迟时间
{   0,                  36000,              0,              0x0141, 154 ,           },  // F5-21   DO3输出延迟时间
{   0,                  11111,              0,              0x4140, 155 ,           },  // F5-22   DO有效状态选择

//  F6 下限             F6 上限             F6 出厂值       F6 属性 F6-EEPROM地址
{   0,                  2,                  0,              0x0040, 156 ,           },
{   0,                  2,                  0,              0x0840, 157 ,           },
{   1,                  100,                20,             0x00C0, 158 ,           },
{   0,                  1000,               0,              0x010A, 159 ,           },
{   0,                  1000,               0,              0x08C1, 160 ,           },
{   0,                  100,                0,              0x08F0, 161 ,           },  // 5
{   0,                  1000,               0,              0x0901, 162 ,           },  
{   0,                  2,                  0,              0x0840, 163 ,           },  
{   0,                  1000,               300,            0x0931, 164 ,           },  
{   0,                  1000,               300,            0x0931, 165 ,           },  
{   0,                  1,                  0,              0x0040, 166 ,           },  // 10
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 167 ,           },  
{   0,                  1000,               0,              0x00C1, 168 ,           },  
{   0,                  100,                0,              0x00F0, 169 ,           },  
{   0,                  1000,               0,              0x00C1, 170 ,           },  
{   0,                  100,                100,            0x00F0, 171 ,           },  // 15

//  F7 下限             F7 上限             F7 出厂值       F7 属性 F7-EEPROM地址
{   0,                  1,                  0,              0x1040, 172 ,           },  // 0
{   0,                  4,                  0,              0x0840, 173 ,           },
{   0,                  1,                  1,              0x0040, 174 ,           },
{   0,                  0xFFFF,             0x1F,           0x8140, 175 ,           },
{   0,                  0xFFFF,             0,              0x8140, 176 ,           },
{   1,                  0xFFFF,             0x33,           0x8140, 177 ,           },  // 5
{   1,                  65000,              10000,          0x0144, 178 ,           },
{   0,                  999,                0,              0x30C0, 179 ,           },
{   0,                  999,                0,              0x30C0, 180 ,           },
{   0,                  65535,              0,              0x1140, 181 ,           },
{   0,                  65535,              0,              0x1142, 182 ,           },  // 10
{   0,                  65535,              0,              0x1142, 183 ,           },
{   0,                  3,                  1,              0x0040, 184 ,           },  //
{   0,                  65535,              0,              0x1140, 185 ,           },  //
{   0,                  65535,              0,              0x1140, 186 ,           },  //
 
//  F8 下限             F8 上限             F8 出厂值       F8 属性 F8-EEPROM地址
{   0,                  MAX_FRQ_INDEX,      200,            0x034A, 187 ,           },  // 0
{   0,                  65000,              200,            0x0141, 188 ,           },  
{   0,                  65000,              200,            0x0141, 189 ,           },  
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 190 ,           },  
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 191 ,           },  
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 192 ,           },  // 5
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 193 ,           },  
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 194 ,           },  
{   0,                  65000,              ACC_DEC_T_INIT1,0x0141, 195 ,           },  
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 196 ,           },  
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 197 ,           },  // 10
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 198 ,           },  
{   0,                  30000,              0,              0x0141, 199 ,           },  
{   0,                  1,                  0,              0x0040, 200 ,           },  
{   0,                  2,                  0,              0x0040, 201 ,           },  
{   0,                  1000,               0,              0x010A, 202 ,           },  // 15
{   0,                  65000,              0,              0x0040, 203 ,           },  
{   0,                  65000,              0,              0x0140, 204 ,           },  
{   0,                  1,                  0,              0x0040, 205 ,           },  
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 206 ,           },  
{   0,                  1000,               50,             0x0131, 207 ,           },  // 20
{   0,                  1000,               0,              0x0131, 208 ,           },
{   0,                  1,                  0,              0x0040, 209 ,           },
{   0,                  1,                  0,              0x1840, 210 ,           },
// ADD
{   0,                  1,                  0,              0x1840, 671 ,           },  // 24
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 672 ,           },  // 25
{   0,                  MAX_FRQ_INDEX,      0,              0x034A, 673 ,           },  // 26
{   0,                  1,                  0,              0x0040, 674 ,           },  // 27   
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 675 ,           },  // 28
{   0,                  1000,               50,             0x0131, 676 ,           },  // 29
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 677 ,           },  // 30  
{   0,                  1000,               0,              0x0131, 678 ,           },  // 31
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 679 ,           },  // 32  
{   0,                  1000,               0,              0x0131, 680 ,           },  // 33
{   0,                  3000,               50,             0x0131, 681 ,           },  // 34
{   1,                  60000,              10,             0x0142, 682 ,           },  // 35
{   0,                  3000,               2000,           0x0131, 683 ,           },  // 36
{   0,                  60000,              0,              0x0142, 684 ,           },  // 37
{   0,                  3000,               1000,           0x0131, 685 ,           },  // 38
{   0,                  3000,               0,              0x0131, 686 ,           },  // 39
{   0,                  3000,               1000,           0x0131, 687 ,           },  // 40
{   0,                  3000,               0,              0x0131, 688 ,           },  // 41
{   0,                     1,               0,              0x0840, 689 ,           },  // 42
{   0,                     3,               0,              0x0840, 690 ,           },  // 43
{   0,                 65000,               0,              0x0941, 691 ,           },  // 44
{   0,             AI1_UPPER,               310,            0x0322, 692 ,           },  // 45
{   AI1_LIMIT,          1100,               680,            0x0522, 693 ,           },  // 46
{   0,                   100,                75,            0x0100, 694 ,           },  // 47
{   0,                     1,                 0,            0x0840, 695 ,           },  // 48
{   WAKE_UP_LIMIT,      MAX_FRQ_INDEX,        0,            0x074A, 696 ,           },  // 49
{   0,                 65000,                 0,            0x0141, 697 ,           },  // 50
{   0,                  DORMANT_UPPER,        0,            0x034A, 698 ,           },  // 51
{   0,                 65000,                 0,            0x0141, 699 ,           },  // 52
{   0,                 65000,               0,              0x0941, 986 ,           },  // 53

//  F9 下限             F9 上限             F9 出厂值       F9 属性 F9-EEPROM地址
{   0,                  1,                  1,              0x0040, 211 ,           },  // 0
{   20,                 1000,               100,            0x0102, 212 ,           },  
{   50,                 100,                80,             0x00F0, 213 ,           },  
{   0,                  100,                0,              0x00C0, 214 ,           },  
{   120,                150,                130,            0x00F0, 215 ,           },  
{   0,                  100,                20,             0x00C0, 216 ,           },  // 5
{   100,                200,                150,            0x00F0, 217 ,           },  
{   0,                  1,                  1,              0x0040, 218 ,           },  
{   0,                  0,                  0,              0x1040, 219 ,           },  
{   0,                  20,                 0,              0x0040, 220 ,           },  
{   0,                  1,                  0,              0x0040, 221 ,           },  // 10
{   1,                  1000,               10,             0x0101, 222 ,           },  
{   0,                  11,                 11,             0x4040, 223 ,           },  
{   0,                  1,                  1,              0x0040, 224 ,           },  
    
{   0,                  99,                 0,              0x1080, 225 ,           },  // 第一次故障类型
{   0,                  99,                 0,              0x1080, 226 ,           },  // 15
{   0,                  99,                 0,              0x1080, 227 ,           },  

{   0,                  65535,              0,              0x114A, 228 ,           },  // 17，故障频率，小数点要记忆
{   0,                  65535,              0,              0x1152, 229 ,           },  // 故障电流，跟当前机型相关
{   0,                  65535,              0,              0x1161, 230 ,           },  
{   0,                  9999,               0,              0x1100, 231 ,           },  // 20
{   0,                  9999,               0,              0x1100, 232 ,           },
{   0,                  65535,              0,              0x1100, 233 ,           },  //
{   0,                  65535,              0,              0x1100, 234 ,           },  //
{   0,                  65535,              0,              0x1101, 235 ,           },  //
{   0,                  65535,              0,              0x1040, 236 ,           },  // 25
{   0,                  65535,              0,              0x1040, 237 ,           },  //

{   0,                  65535,              0,              0x114A, 238 ,           },  // 27，故障频率，小数点要记忆
{   0,                  65535,              0,              0x1152, 239 ,           },  // 故障电流，跟当前机型相关
{   0,                  65535,              0,              0x1161, 240 ,           },  
{   0,                  9999,               0,              0x1100, 241 ,           },  // 30
{   0,                  9999,               0,              0x1100, 242 ,           },
{   0,                  65535,              0,              0x1100, 243 ,           },  //
{   0,                  65535,              0,              0x1100, 244 ,           },  //
{   0,                  65535,              0,              0x1101, 245 ,           },  //
{   0,                  65535,              0,              0x1040, 246 ,           },  // 35
{   0,                  65535,              0,              0x1040, 247 ,           },  //

{   0,                  65535,              0,              0x114A, 248 ,           },  // 37，故障频率，小数点要记忆
{   0,                  65535,              0,              0x1152, 249 ,           },  // 故障电流，跟当前机型相关
{   0,                  65535,              0,              0x1161, 250 ,           },  
{   0,                  9999,               0,              0x1100, 251 ,           },  // 40
{   0,                  9999,               0,              0x1100, 252 ,           },
{   0,                  65535,              0,              0x1100, 253 ,           },  //
{   0,                  65535,              0,              0x1100, 254 ,           },  //
{   0,                  65535,              0,              0x1101, 255 ,           },  //
{   0,                  65535,              0,              0x1040, 256 ,           },  // 45
{   0,                  65535,              0,              0x1040, 257 ,           },  //


{   0,                  22222,              0,              0x4040, 582 ,           },  // 47
{   0,                  22210,              0,              0x4040, 583 ,           },  //
{   0,                  22222,              0,              0x4040, 584 ,           },  //
{   0,                  22222,              0,              0x4040, 585 ,           },  // 50
{   0,                      0,              0,              0x5040, 573 ,           },  // 51

{   0,                  65535,              0,              0x1040, 586 ,           },  //
{   0,                  65535,              0,              0x1040, 587 ,           },  //
{   0,                      4,              0,              0x0040, 588 ,           },  //
{   0,                   1000,           1000,              0x0131, 589 ,           },  //

{   0,                  2,                  0,              0x0040, 590 ,           },  // 56
{   0,                  200,              110,              0x00C0, 591 ,           },  // 57
{   0,                  200,               90,              0x00C0, 572 ,           },  // 58

{   0,                   2,                 0,              0x4040, 258 ,           },  // F9-59   瞬停不停功能选择
{   800,                1000,               900,            0x0131, 259 ,           },  // F9-60   瞬停不停频率切换点
{   0,                  10000,              50,             0x0142, 260 ,           },  // F9-61   瞬停不停电压回升判断时间
{   600,                1000,               800,            0x0131, 261 ,           },  // F9-62   瞬停不停动作判断电压
{   0,                  1,                  0,              0x0040, 262 ,           },  // F9-63   掉载保护功能
{   0,                  1000,               100,            0x0131, 263 ,           },  
{   0,                  600,                10,             0x00C1, 264 ,           },  
{   0,                0x222,                 0,             0x90C0, 265 ,           },  //

{   0,                  500,                200,            0x0131, 532 ,           },  
{   0,                  600,                10,              0x00C1, 533 ,           },  
{   0,                  500,                200,            0x0131, 562 ,           },  
{   0,                  600,                50,             0x00C1, 592 ,           },  


//  FA 下限             FA 上限             FA 出厂值       FA 属性 FA-EEPROM地址
{   0,                  6,                  0,              0x0040, 266 ,           },  // 0
{   0,                  1000,               500,            0x0131, 267 ,           },  
{   0,                  8,                  0,              0x0040, 268 ,           },  
{   0,                  1,                  0,              0x0040, 269 ,           },  
{   0,                  65535,              1000,           0x0140, 270 ,           },  
{   0,                   1000,              200,            0x0101, 271 ,           },  // 5
{   1,                  1000,               200,            0x0102, 272 ,           },
{   0,                  10000,              0,              0x0103, 273 ,           },
{   0,                  MAX_FRQ_INDEX,      200,            0x034A, 274 ,           },
{   0,                  1000,               0,              0x0131, 275 ,           },
{   0,                10000,                10,             0x00F2, 276 ,           },  // 10
{   0,                  65000,              0,              0x0102, 279 ,           },  //
{   0,                  6000,               0,              0x0102, 280 ,           },  //
{   0,                  6000,               0,              0x0102, 281 ,           },  // 
{   0,                  65535,              0,              0x0140, 282 ,           },  //
{   0,                   1000,              200,            0x0101, 283 ,           },  // 15
{   1,                  1000,               200,            0x0102, 284 ,           },  //
{   0,                  10000,              0,              0x0103, 285 ,           },  //
{   0,                  2,                  0,              0x0040, 286 ,           },  // 
{   0,         PID_PARA_CHG_DELTA1_MAX,     200,            0x0331, 287 ,           },  //
{PID_PARA_CHG_DELTA2_MIN,1000,              800,            0x0531, 288 ,           },  // 20
{   0,                  1000,               0,              0x0131, 277 ,           },  //
{   0,                  65000,              0,              0x0102, 278 ,           },  //
{   0,                10000,                100,            0x00F2, 293 ,           },  // 
{   0,                10000,                100,            0x00F2, 402 ,           },  //
{   0,                  11,                 0,              0x4040, 289 ,           },  // 25
{   0,                  1000,               0,              0x0131, 290 ,           },  //
{   0,                  200,                0,             0x00C1, 291 ,           },  // 
{   0,                  1,                  0,              0x0040, 292 ,           },  //
                                                                 
//  FB 下限             FB 上限             FB 出厂值       FB 属性 FB-EEPROM地址     
{   0,                  1,                  0,              0x0040, 294 ,           },  
{   0,                  1000,               0,              0x0131, 295 ,           },  
{   0,                  500,                0,              0x00F1, 296 ,           },  
{   1,                  30000,              100,            0x0141, 297 ,           },  
{   1,                  1000,               500,            0x0131, 298 ,           },  
{   0,                  65535,              1000,           0x0140, 299 ,           },  // 5
{   0,                  65535,              0,              0x0140, 300 ,           },  
{   1,                  65535,              1000,           0x0141, 301 ,           },  
{   1,                  65535,              1000,           0x0140, 302 ,           },  
{   1,                  65535,              1000,           0x0140, 303 ,           },  
                                                                        
//  FC 下限             FC 上限             FC 出厂值       FC 属性 FC-EEPROM地址        
{   (Uint16)(-1000),    1000,               0,              0x2131, 304 ,           },  // 0
{   (Uint16)(-1000),    1000,               0,              0x2131, 305 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 306 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 307 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 308 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 309 ,           },  // 5
{   (Uint16)(-1000),    1000,               0,              0x2131, 310 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 311 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 312 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 313 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 314 ,           },  // 10
{   (Uint16)(-1000),    1000,               0,              0x2131, 315 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 316 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 317 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 318 ,           },  
{   (Uint16)(-1000),    1000,               0,              0x2131, 319 ,           },  // 15
{   0,                  2,                  0,              0x0040, 320 ,           },  
{   0,                  11,                 0,              0x4080, 321 ,           },  
{   0,                  65000,              0,              0x0141, 322 ,           },  
{   0,                  3,                  0,              0x0040, 323 ,           },  
{   0,                  65000,              0,              0x0141, 324 ,           },  // 20
{   0,                  3,                  0,              0x0040, 325 ,           },  
{   0,                  65000,              0,              0x0141, 326 ,           },  
{   0,                  3,                  0,              0x0040, 327 ,           },  
{   0,                  65000,              0,              0x0141, 328 ,           },  
{   0,                  3,                  0,              0x0040, 329 ,           },  // 25
{   0,                  65000,              0,              0x0141, 330 ,           },  
{   0,                  3,                  0,              0x0040, 331 ,           },  
{   0,                  65000,              0,              0x0141, 332 ,           },  
{   0,                  3,                  0,              0x0040, 333 ,           },  
{   0,                  65000,              0,              0x0141, 334 ,           },  // 30
{   0,                  3,                  0,              0x0040, 335 ,           },  
{   0,                  65000,              0,              0x0141, 336 ,           },  
{   0,                  3,                  0,              0x0040, 337 ,           },  
{   0,                  65000,              0,              0x0141, 338 ,           },  
{   0,                  3,                  0,              0x0040, 339 ,           },  // 35
{   0,                  65000,              0,              0x0141, 340 ,           },  
{   0,                  3,                  0,              0x0040, 341 ,           },  
{   0,                  65000,              0,              0x0141, 342 ,           },  
{   0,                  3,                  0,              0x0040, 343 ,           },  
{   0,                  65000,              0,              0x0141, 344 ,           },  // 40
{   0,                  3,                  0,              0x0040, 345 ,           },  
{   0,                  65000,              0,              0x0141, 346 ,           },  
{   0,                  3,                  0,              0x0040, 347 ,           },  
{   0,                  65000,              0,              0x0141, 348 ,           },  
{   0,                  3,                  0,              0x0040, 349 ,           },  // 45
{   0,                  65000,              0,              0x0141, 350 ,           },  
{   0,                  3,                  0,              0x0040, 351 ,           },  
{   0,                  65000,              0,              0x0141, 352 ,           },  
{   0,                  3,                  0,              0x0040, 353 ,           },  
{   0,                  1,                  0,              0x0040, 354 ,           },  // 50
{   0,                  6,                  0,              0x0040, 355 ,           },  // FC-51   多段速0给定方式
                                                                        
//  FD 下限             FD 上限             FD 出厂值       FD 属性 FD-EEPROM地址     
{   0,                  6039,            6005,              0x6040, 356 ,           },  // 0
{   0,                  3,                  0,              0x0040, 357 ,           },  // 1
{   1,                  249,                1,              0x00C0, 358 ,           },  // 2
{   0,                  20,                 2,              0x0080, 359 ,           },  // 3
{   0,                  600,                0,              0x00C1, 360 ,           },  // 4
{   0,                  31,                30,              0x2040, 361 ,           },  // 5

{   0,                  1,                  0,              0x0040, 363 ,           },  // 7
{   0,                  1,                  0,              0x0040, 364 ,           },  // 8

//  FE 下限             FE 上限             FE 出厂值       FE 属性 FE-EEPROM地址       // 280有320没有的功能码
{   0,                  65535,              1,              0x0140, 730 ,           },  // FE// 0
{   0,                  65535,              2,              0x0140, 731 ,           },  
{   0,                  65535,              3,              0x0140, 732 ,           },  
{   0,                  65535,              7,              0x0140, 733 ,           },  
{   0,                  65535,              8,              0x0140, 734 ,           },  
{   0,                  65535,              17,             0x0140, 735 ,           },  // 5
{   0,                  65535,              18,             0x0140, 736 ,           },  
{   0,                  65535,              300,            0x0140, 737 ,           },  
{   0,                  65535,              301,            0x0140, 738 ,           },  
{   0,                  65535,              400,            0x0140, 739 ,           },  
{   0,                  65535,              401,            0x0140, 740 ,           },  // 10
{   0,                  65535,              402,            0x0140, 741 ,           },  
{   0,                  65535,              504,            0x0140, 742 ,           },  
{   0,                  65535,              507,            0x0140, 743 ,           },  
{   0,                  65535,              600,            0x0140, 744 ,           },  
{   0,                  65535,              610,            0x0140, 745 ,           },  // 15
{   0,                  65535,              0,              0x0140, 746 ,           },  
{   0,                  65535,              0,              0x0140, 747 ,           },  
{   0,                  65535,              0,              0x0140, 748 ,           },  
{   0,                  65535,              0,              0x0140, 749 ,           },  
{   0,                  65535,              0,              0x0140, 750 ,           },  // 20
{   0,                  65535,              0,              0x0140, 751 ,           },  
{   0,                  65535,              0,              0x0140, 752 ,           },  
{   0,                  65535,              0,              0x0140, 753 ,           },  
{   0,                  65535,              0,              0x0140, 754 ,           },  
{   0,                  65535,              0,              0x0140, 755 ,           },  // 25
{   0,                  65535,              0,              0x0140, 756 ,           },  
{   0,                  65535,              0,              0x0140, 757 ,           },  
{   0,                  65535,              0,              0x0140, 758 ,           },  
{   0,                  65535,              0,              0x0140, 759 ,           },  
{   0,                  65535,              0,              0x0140, 760 ,           },  // 30
{   0,                  65535,              0,              0x0140, 761 ,           },  


//  FF 下限             FF 上限             FF 出厂值       FF 属性 FF-EEPROM地址     
{   0  ,                65535,              0   ,           0x0140, 367 ,           },  // FF-00   厂家密码
{   1  ,                537  ,              10  ,           0x0880, 368 ,           },  // FF-01   机型
{   1  ,                2    ,              1   ,           0x0840, 369 ,           },  // FF-02   G/P型号
{   0  ,                65535,              22  ,           0x1141, 370 ,           },  // FF-03   变频器功率
{   1  ,                4    ,              4   ,           0x0840, 371 ,           },  // FF-04   温度曲线
{   900,                1100 ,              1000,           0x0931, 372 ,           },  // FF-05   UV两相增益偏差
{   0,                  65535 ,              0,             0x1902, 373 ,           },  // FF-06
{   0,                  65535 ,              0,             0x1902, 374 ,           },  // FF-07
{   350,                2000 ,              1000,           0x0131, 375 ,           },  // FF-08   电压校正系数
{   350,                2000 ,              1000,           0x0131, 376 ,           },  // FF-09   电流校正系数
{   0,                  3040 ,              0,              0x0140, 377 ,           },  // FF-10   性能调试显示个数
{   0,                  0x111,              0,              0x8840, 378 ,           },  
{   0x0000,             0xBFFF,             0x8836,         0x8140, 379 ,           },  //
                                                                        
//  FP 下限             FP 上限             FP 出厂值       FP 属性 FP-EEPROM地址     
{   0,                  65535,              0,              0x0140, 381 ,           },  // FP-00   用户密码
{   0,     PARA_INIT_MODE_MAX,              0,              0x0840, 382 ,           },  // FP-01   参数初始化
{   0,                     11,             11,              0x4040, 383 ,           },  // FP-02   菜单模式
{   0,                     11,              0,              0x4040, 384 ,           },  //
{   0,                      1,              0,              0x0140, 385 ,           },  //
{   0,                  65535,              0,              0x0140, 403 ,           },                                                                 

//=========================================================================================================
//  A0-AF                                                               
//=========================================================================================================

//  A0 下限             A0 上限             A0 出厂值       A0 属性 A0-EEPROM地址     
{   0,                  1,                  0,              0x0840, 409 ,           },  // 0
{   0,                  7,                  0,              0x0840, 410 ,           },  // 1
{   0,                  5,                  0,              0x1040, 411 ,           },  // 2
{(Uint16)(-2000),       2000,               1500,           0x2131, 412 ,           },  // 3
{   0,                  1000,               0,              0x0142, 413 ,           },  // 4
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 414 ,           },  // 5
{   0,                  MAX_FRQ_INDEX,      5000,           0x034A, 415 ,           },  // 6
{   0,                  65000,              0,              0x0142, 416 ,           },  // 7
{   0,                  65000,              0,              0x0142, 417 ,           },  // 8

//  A1 下限             A1 上限             A1 出厂值       A1 属性 A1-EEPROM地址     
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 508 ,           },  // 0
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 509 ,           },  // 1
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 510 ,           },  // 2
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 511 ,           },  // 3
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 512 ,           },  // 4 
{   0,                  22222,              0,              0x4940, 513 ,           },  // 5
{   0,                  11111,              0,              0x4140, 514 ,           },  // 6
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 515 ,           },  // 7
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 516 ,           },  // 8
{   0,                  DI_FUNC_NUMBER-1,   0,              0x0880, 517 ,           },  // 9
{   0,                  111,                0,              0x4940, 518 ,           },  // 10
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 519 ,           },  // 11
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 520 ,           },  // 12
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 521 ,           },  // 13
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 522 ,           },  // 14
{   0,                  (DO_FUNC_NUMBER-1), 0,              0x0080, 523 ,           },  // 15
{   0,                  36000     ,         0,              0x0141, 524 ,           },  // 16   VDO1输出延迟时间，0.1s
{   0,                  36000     ,         0,              0x0141, 525 ,           },  // 17   VDO2输出延迟时间，0.1s
{   0,                  36000     ,         0,              0x0141, 526 ,           },  // 18   VDO3输出延迟时间
{   0,                  36000     ,         0,              0x0141, 527 ,           },  // 19   VDO4输出延迟时间
{   0,                  36000     ,         0,              0x0141, 528 ,           },  // 20   VDO5输出延迟时间
{   0,                  11111     ,         0,              0x4080, 529 ,           },  // 21   DO有效状态选择

//  A2 下限             A2 上限             A2 出厂值       A2 属性 A2-EEPROM地址
{   0,                  2,                  0,              0x0840, 418 ,           },  // 0
{   1,                  65535,              37,             0x0941, 419 ,           },  // 1
{   1,                  2000,               380,            0x08E0, 420 ,           },  // 2
{   1,                  65535,              900,            0x0952, 421 ,           },  // 3
{   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 422 ,           },  // 4
{   1,                  65535,              1460,           0x0958, 423 ,           },  // 5
{   1,                  65535,              1204,           0x0943, 424 ,           },  // 6  异步机定子电阻
{   1,                  65535,              908,            0x0943, 425 ,           },  // 7
{   1,                  65535,              528,            0x0942, 426 ,           },  // 8
{   1,                  65535,              1586,           0x0941, 427 ,           },  // 9
{   1,                  RATING_CUR_INDEX2,  424,            0x0B52, 428 ,           },  // 10 空载电流
{   0,                  65535,              0,              0x1140, 429 ,           },  // 11
{   0,                  65535,              0,              0x1140, 430 ,           },  // 12
{   0,                  65535,              0,              0x1140, 431 ,           },  // 13
{   0,                  65535,              0,              0x1140, 432 ,           },  // 14
{   0,                  65535,              0,              0x1140, 433 ,           },  // 15 
{   1,                  65535,              1204,           0x0943, 434 ,           },  // 16 同步机定子电阻
{   1,                  65535,              1586,           0x0942, 435 ,           },  // 17
{   1,                  65535,              1586,           0x0942, 436 ,           },  // 18
{   1,                  65535,              0,              0x1180, 437 ,           },  // 19
{   0,                  65535,              3000,           0x0961, 438 ,           },  // 20 
{   0,                  60000,              0,              0x1943, 439 ,           },  // 21
{   0,                  65535,              0,              0x1140, 440 ,           },  // 22
{   0,                  65535,              0,              0x1140, 441 ,           },  // 23
{   0,                  65535,              0,              0x1140, 442 ,           },  // 24
{   0,                  65535,              0,              0x1140, 443 ,           },  // 25
{   0,                  65535,              0,              0x1140, 444 ,           },  // 26
// PG卡参数
{   1,                  65535,              2500,           0x0940, 609  ,          },  // 27
{   0,                      4,              0,              0x0940, 610  ,          },  // 28
{   0,                      2,              0,              0x0940, 611  ,          },  // 29
{   0,                      1,              0,              0x0840, 612  ,          },  // 30 旋变方向
{   0,                   3599,              0,              0x0901, 613  ,          },  // 31 编码器安装位置角
{   0,                      1,              0,              0x0840, 614  ,          },  // 32 UVW信号方向
{   0,                   3599,              0,              0x0901, 615  ,          },  // 33 UVW信号零点位置角
{   1,                  65535,              1,              0x0940, 616  ,          },  // 34 旋变极对数
{   1,                  65535,              4,              0x1140, 617  ,          },  // 35 UVW极对数
{   0,                    100,              0,              0x08C1, 618  ,          },  // 36 速度反馈PG断线检测时间
// 调谐
{   0,                  12,                 0,              0x0840, 619  ,          },  // 37 调谐选择
// 矢量控制参数
{   1,                  100,                30,             0x00C0, 448 ,           },  // 38
{   1,                  1000,               50,             0x0102, 449 ,           },  // 39
{   0,                  VC_CHG_FRQ2_INDEX2, 500,            0x034A, 450 ,           },  // 40
{   1,                  100,                20,             0x00C0, 451 ,           },  // 41
{   1,                  1000,               100,            0x0102, 452 ,           },  // 42
{   VC_CHG_FRQ1_INDEX2, MAX_FRQ_INDEX,      1000,           0x074A, 453 ,           },  // 43
{   50,                 200,                100,            0x00F0, 454 ,           },  // 44
{   0,                  100,                0,              0x0103, 455 ,           },  // 45
{   0,                  200,                64,             0x0140, 456 ,           },  // 46
{   0,                  7,                  0,              0x0040, 457 ,           },  // 47
{   0,                  2000,               1500,           0x0131, 831 ,           },  // 48
{   0,                  8,                  0,              0x1040, 832 ,           },  // 49
{   0,                  2000,               0,              0x1131, 833 ,           },  // 50
{   0,                  60000,              2000,           0x0140, 834 ,           },  // 51
{   0,                  60000,              1300,           0x0140, 835 ,           },  // 52
{   0,                  60000,              2000,           0x0140, 836 ,           },  // 53
{   0,                  60000,              1300,           0x0140, 837 ,           },  // 54
{   0,                  65535,              0,              0x1140, 838 ,           },  // 55
{   0,                      2,              1,              0x0040, 839 ,           },  // 56
{   50,                   500,              100,            0x00F0, 840 ,           },  // 57
{   1,                    300,               50,            0x00F0, 600 ,           },  // 58
{   10,                   500,              100,            0x00F0, 601 ,           },  // 59
{   2,                     10,                2,            0x0080, 602 ,           },  // 60
// 控制方式
{   0,                  2,                  0,              0x0840, 446 ,           },  // 61
{   0,                  4,                  0,              0x0040, 447 ,           },  // 62
{   0,                  300,                10,             0x00F1, 841 ,           },  // 63
{   0,                    11,               0,              0x5040, 842 ,           },  // 64
{   0,                  100,                0,              0x00C0, 843 ,           },  // 65

//  A3 下限             A3 上限             A3 出厂值       A3 属性 A3-EEPROM地址
{   0,                  2,                  0,              0x0840, 844 ,           },  // 0
{   1,                  65535,              37,             0x0941, 845 ,           },  // 1
{   1,                  2000,               380,            0x08E0, 846 ,           },  // 2
{   1,                  65535,              900,            0x0952, 847 ,           },  // 3
{   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 848 ,           },  // 4
{   1,                  65535,              1460,           0x0958, 849 ,           },  // 5
{   1,                  65535,              1204,           0x0943, 850 ,           },  // 6  异步机定子电阻
{   1,                  65535,              908,            0x0943, 851 ,           },  // 7
{   1,                  65535,              528,            0x0942, 852 ,           },  // 8
{   1,                  65535,              1586,           0x0941, 853 ,           },  // 9
{   1,                  RATING_CUR_INDEX3,  424,            0x0B52, 854 ,           },  // 10 空载电流
{   0,                  65535,              0,              0x1140, 855 ,           },  // 11
{   0,                  65535,              0,              0x1140, 856 ,           },  // 12
{   0,                  65535,              0,              0x1140, 857 ,           },  // 13
{   0,                  65535,              0,              0x1140, 858 ,           },  // 14
{   0,                  65535,              0,              0x1140, 859 ,           },  // 15
{   1,                  65535,              1204,           0x0943, 860 ,           },  // 16 同步机定子电阻
{   1,                  65535,              1586,           0x0942, 861 ,           },  // 17
{   1,                  65535,              1586,           0x0942, 862 ,           },  // 18
{   1,                  65535,              0,              0x1180, 863 ,           },  // 19
{   0,                  65535,              3000,           0x0961, 864 ,           },  // 20 
{   0,                  60000,              0,              0x1943, 865 ,           },  // 21
{   0,                  65535,              0,              0x1140, 866 ,           },  // 22
{   0,                  65535,              0,              0x1140, 867 ,           },  // 23
{   0,                  65535,              0,              0x1140, 868 ,           },  // 24
{   0,                  65535,              0,              0x1140, 869 ,           },  // 25
{   0,                  65535,              0,              0x1140, 870 ,           },  // 26
// PG卡参数
{   1,                  65535,              2500,           0x0940, 620  ,          },  // 27
{   0,                      4,              0,              0x0940, 621 ,           },  // 28
{   0,                      2,              0,              0x0940, 622 ,           },  // 29
{   0,                      1,              0,              0x0840, 623 ,           },  // 30 旋变方向
{   0,                   3599,              0,              0x0901, 624 ,           },  // 31 编码器安装位置角
{   0,                      1,              0,              0x0840, 625  ,          },  // 32 UVW信号方向
{   0,                   3599,              0,              0x0901, 626 ,           },  // 33 UVW信号零点位置角
{   1,                  65535,              1,              0x0940, 627  ,          },  // 34 旋变极对数
{   1,                  65535,              4,              0x1140, 628  ,          },  // 35 UVW极对数
{   0,                    100,              0,              0x08C1, 629   ,         },  // 36 速度反馈PG断线检测时间
// 调谐
{   0,                  12,                 0,              0x0840, 630   ,         },  // 37 调谐选择
// 矢量控制参数
{   1,                  100,                30,             0x00C0, 874 ,           },  // 38
{   1,                  1000,               50,             0x0102, 875 ,           },  // 39
{   0,                  VC_CHG_FRQ2_INDEX3, 500,            0x034A, 876 ,           },  // 40
{   1,                  100,                20,             0x00C0, 877 ,           },  // 41
{   1,                  1000,               100,            0x0102, 878 ,           },  // 42
{   VC_CHG_FRQ1_INDEX3, MAX_FRQ_INDEX,      1000,           0x074A, 879 ,           },  // 43
{   50,                 200,                100,            0x00F0, 880 ,           },  // 44
{   0,                  100,                0,              0x0103, 881 ,           },  // 45
{   0,                  200,                64,             0x0140, 882 ,           },  // 46
{   0,                  7,                  0,              0x0040, 883 ,           },  // 47
{   0,                  2000,               1500,           0x0131, 884 ,           },  // 48 
{   0,                  8,                  0,              0x1040, 885 ,           },  // 49
{   0,                  2000,               1500,           0x1131, 886 ,           },  // 50
{   0,                  60000,              2000,           0x0140, 887 ,           },  // 51
{   0,                  60000,              1300,           0x0140, 888 ,           },  // 52
{   0,                  60000,              2000,           0x0140, 889 ,           },  // 53
{   0,                  60000,              1300,           0x0140, 890 ,           },  // 54
{   0,                  65535,              0,              0x1140, 891 ,           },  // 55
{   0,                      2,              1,              0x0040, 892 ,           },  // 56
{   50,                   500,              100,            0x00F0, 893 ,           },  // 57
{   1,                    300,               50,            0x00F0, 603 ,           },  // 58
{   10,                   500,              100,            0x00F0, 604 ,           },  // 59
{   2,                     10,                2,            0x0080, 605 ,           },  // 60
// 控制方式
{   0,                  2,                  0,              0x0840, 872 ,           },  // 61
{   0,                  4,                  0,              0x0040, 873 ,           },  // 62
{   0,                  300,                10,             0x00F1, 894 ,           },  // 63
{   0,                    11,               0,              0x5040, 895 ,           },  // 64
{   0,                  100,                0,              0x00C0, 896 ,           },  // 65

//  A4 下限             A4 上限             A4 出厂值       A4 属性 A4-EEPROM地址
{   0,                  2,                  0,              0x0840, 897 ,           },  // 0
{   1,                  65535,              37,             0x0941, 898 ,           },  // 1
{   1,                  2000,               380,            0x08E0, 899 ,           },  // 2
{   1,                  65535,              900,            0x0952, 900 ,           },  // 3
{   1,                  MAX_FRQ_INDEX,      5000,           0x0B4A, 901 ,           },  // 4
{   1,                  65535,              1460,           0x0958, 902 ,           },  // 5
{   1,                  65535,              1204,           0x0943, 903 ,           },  // 6  异步机定子电阻
{   1,                  65535,              908,            0x0943, 904 ,           },  // 7
{   1,                  65535,              528,            0x0942, 905 ,           },  // 8
{   1,                  65535,              1586,           0x0941, 906 ,           },  // 9
{   1,                  RATING_CUR_INDEX4,  424,            0x0B52, 907 ,           },  // 10 空载电流
{   0,                  65535,              0,              0x1140, 908 ,           },  // 11
{   0,                  65535,              0,              0x1140, 909 ,           },  // 12
{   0,                  65535,              0,              0x1140, 910 ,           },  // 13
{   0,                  65535,              0,              0x1140, 911 ,           },  // 14
{   0,                  65535,              0,              0x1140, 912 ,           },  // 15
{   1,                  65535,              1204,           0x0943, 913 ,           },  // 16 同步机定子电阻
{   1,                  65535,              1586,           0x0942, 914 ,           },  // 17
{   1,                  65535,              1586,           0x0942, 915 ,           },  // 18
{   1,                  65535,              0,              0x1180, 916 ,           },  // 19
{   0,                  65535,              3000,           0x0961, 917 ,           },  // 20 
{   0,                  60000,              0,              0x1943, 871 ,           },  // 21
{   0,                  65535,              0,              0x1140, 445 ,           },  // 22
{   0,                  65535,              0,              0x1140, 934 ,           },  // 23
{   0,                  65535,              0,              0x1140, 703 ,           },  // 24
{   0,                  65535,              0,              0x1140, 704 ,           },  // 25 
{   0,                  65535,              0,              0x1140, 645 ,           },  // 26
// PG卡参数
{   1,                  65535,              2500,           0x0940, 631   ,         },  // 27
{   0,                      4,              0,              0x0940, 632  ,          },  // 28
{   0,                      2,              0,              0x0940, 633  ,          },  // 29
{   0,                      1,              0,              0x0840, 634  ,          },  // 30 旋变方向
{   0,                   3599,              0,              0x0901, 635  ,          },  // 31 编码器安装位置角
{   0,                      1,              0,              0x0840, 636   ,         },  // 32 UVW信号方向
{   0,                   3599,              0,              0x0901, 637 ,           },  // 33 UVW信号零点位置角
{   1,                  65535,              1,              0x0940, 638  ,          },  // 34 旋变极对数
{   1,                  65535,              4,              0x1140, 639  ,          },  // 35 UVW极对数
{   0,                    100,              0,              0x08C1, 640   ,         },  // 36 速度反馈PG断线检测时间
// 调谐
{   0,                  12,                 0,              0x0840, 641   ,         },  // 37 调谐选择
// 矢量控制参数
{   1,                  100,                30,             0x00C0, 648 ,           },  // 38
{   1,                  1000,               50,             0x0102, 649 ,           },  // 39
{   0,                  VC_CHG_FRQ2_INDEX4, 500,            0x034A, 650 ,           },  // 40
{   1,                  100,                20,             0x00C0, 651 ,           },  // 41
{   1,                  1000,               100,            0x0102, 652 ,           },  // 42
{   VC_CHG_FRQ1_INDEX4, MAX_FRQ_INDEX,      1000,           0x074A, 653 ,           },  // 43
{   50,                 200,                100,            0x00F0, 654 ,           },  // 44
{   0,                  100,                0,              0x0103, 655 ,           },  // 45
{   0,                  200,                64,             0x0140, 656 ,           },  // 46
{   0,                  7,                  0,              0x0040, 657 ,           },  // 47
{   0,                  2000,               1500,           0x0131, 658 ,           },  // 48
{   0,                  8,                  0,              0x1040, 659 ,           },  // 49
{   0,                  2000,               1500,           0x1131, 660 ,           },  // 50
{   0,                  60000,              2000,           0x0140, 661 ,           },  // 51
{   0,                  60000,              1300,           0x0140, 662 ,           },  // 52
{   0,                  60000,              2000,           0x0140, 663 ,           },  // 53
{   0,                  60000,              1300,           0x0140, 664 ,           },  // 54
{   0,                  65535,              0,              0x1140, 665 ,           },  // 55
{   0,                      2,              1,              0x0040, 666 ,           },  // 56
{   50,                   500,              100,            0x00F0, 667 ,           },  // 57
{   1,                    300,               50,            0x00F0, 606 ,           },  // 58
{   10,                   500,              100,            0x00F0, 607 ,           },  // 59
{   2,                     10,                2,            0x0080, 608 ,           },  // 60
// 控制方式
{   0,                  2,                  0,              0x0840, 646 ,           },  // 61
{   0,                  4,                  0,              0x0040, 647 ,           },  // 62
{   0,                  300,                10,             0x00F1, 668 ,           },  // 63
{   0,                    11,               0,              0x5040, 669 ,           },  // 64
{   0,                  100,                0,              0x00C0, 670 ,           },  // 65

//  A5 下限             A5 上限             A5 出厂值       A5 属性 A0-EEPROM地址     
{   0,                   1500,           1200,              0x010A, 386 ,           },  // A5-00
{   0,                      1,              0,              0x0140, 387 ,           },  // 1
{   0,                      2,              1,              0x0140, 388 ,           },  // 2
{   0,                     10,              0,              0x0140, 393 ,           },  // 3
{   0,                      1,              1,              0x0140, 394 ,           },  // 4
{   0,                    100,              5,              0x0100, 395 ,           },  // 5
{ 600,                   1400,           1000,              0x0131, 396 ,           },  // 6
{   0,                      2,              1,              0x0940, 366 ,           },  // 7
{ 100,                    200,            150,              0x08F0, 389 ,           },  // 8
{ 2000,                 25000,          20000,              0x0921, 390 ,           },  // 9

//  A6 下限             A6 上限             A6 出厂值       A6 属性 A6-EEPROM地址     
{   (Uint16)(-1000),  CURVE4_INFLEX1_INDEX, 0,              0x2322, 458 ,           },  // 0
{   (Uint16)(-1000),    1000,               0,              0x2131, 459 ,           },  // 1
{  CURVE4_MIN_INDEX,  CURVE4_INFLEX2_INDEX, 300,            0x2722, 460 ,           },  // 2
{   (Uint16)(-1000),    1000,               300,            0x2131, 461 ,           },  // 3
{  CURVE4_INFLEX1_INDEX,  CURVE4_MAX_INDEX, 600,            0x2722, 462 ,           },  // 4
{   (Uint16)(-1000),    1000,               600,            0x2131, 463 ,           },  // 5
{  CURVE4_INFLEX2_INDEX,1000,               1000,           0x2522, 464 ,           },  // 6
{   (Uint16)(-1000),    1000,               1000,           0x2131, 465 ,           },  // 7
{   (Uint16)(-1000),  CURVE5_INFLEX1_INDEX, (Uint16)-1000,  0x2322, 466 ,           },  // 8
{   (Uint16)(-1000),    1000,               (Uint16)-1000,  0x2131, 467 ,           },  // 9
{  CURVE5_MIN_INDEX,  CURVE5_INFLEX2_INDEX, (Uint16)-300,   0x2722, 468 ,           },  // 10
{   (Uint16)(-1000),    1000,               (Uint16)-300,   0x2131, 469 ,           },  // 11
{  CURVE5_INFLEX1_INDEX, CURVE5_MAX_INDEX,  300,            0x2722, 470 ,           },  // 12
{   (Uint16)(-1000),    1000,               300,            0x2131, 471 ,           },  // 13
{  CURVE5_INFLEX2_INDEX,1000,               1000,           0x2522, 472 ,           },  // 14
{   (Uint16)(-1000),    1000,               1000,           0x2131, 473 ,           },  // 15
{   0,                     0,               0,              0x1040, 474 ,           },  // 16
{   0,                     0,               0,              0x1040, 475 ,           },  // 17
{   0,                     0,               0,              0x1040, 476 ,           },  // 18
{   0,                     0,               0,              0x1040, 477 ,           },  // 19
{   0,                     0,               0,              0x1040, 478 ,           },  // 20
{   0,                     0,               0,              0x1040, 479 ,           },  // 21
{   0,                     0,               0,              0x1040, 480 ,           },  // 22
{   0,                     0,               0,              0x1040, 481 ,           },  // 23
{   (Uint16)(-1000),    1000,               0,              0x2131, 482 ,           },  // 24
{   0,                  1000,               5,              0x0131, 483 ,           },  // 25
{   (Uint16)(-1000),    1000,               0,              0x2131, 484 ,           },  // 26
{   0,                  1000,               5,              0x0131, 485 ,           },  // 27
{   (Uint16)(-1000),    1000,               0,              0x2131, 486 ,           },  // 28
{   0,                  1000,               5,              0x0131, 487 ,           },  // 29
  
//  A7 下限             A7 上限             A7 出厂值       A7 属性 A7-EEPROM地址     
{   0,                  1,                  0,              0x0840, 408 ,           },  // 0
{   0,              11111,                  0,              0x4940, 945 ,           },  // 1
{   0,                  7,                  0,              0x0840, 983 ,           },  // 2
{   0,               1000,                  0,              0x0131, 946 ,           },  // 3
{   0,               1000,                  0,              0x0131, 947 ,           },  // 4
{   0,                111,                  0,              0x40C0, 948 ,           },  // 5
{ (Uint16)(-10000), 10000,                  0,              0x2172, 949 ,           },  // 6
{ (Uint16)(-2000),   2000,                  0,              0x2131, 950 ,           },  // 7
{   0,              65535,                  0,              0x0140, 951 ,           },  // 8
{   0,              65535,                  0,              0x0140, 952 ,           },  // 9
{   0,                  1,                  0,              0x0840, 984 ,           },  // 10  保留
{   0,                  1,                  0,              0x0840, 985 ,           },  // 11

//  A8 下限             A8 上限             A8 出厂值       A8 属性 A8-EEPROM地址            
{   0,                  1,                  0,              0x0800, 534 ,           },  // 0
{   0,                  1,                  0,              0x0800, 987 ,           },  // 1
{   0,                  3,                  0,              0x0800, 988 ,           },  // 2
{   0,                  1,                  0,              0x0800, 989 ,           },  // 3
{   (Uint16)(-10000),   10000,              0,              0x2132, 990 ,           },  // 4
{   (Uint16)(-1000),    1000,               100,            0x2102, 991 ,           },  // 5
{   0,                  100,                10,             0x0941, 992 ,           },  // 6
{   1,                10000,                1,              0x0943, 993 ,           },  // 7
                                                                        
//  A9 下限             A9 上限             A9 出厂值       A9 属性 A9-EEPROM地址     
{   0,                  65535,              0,              0x0040, 535 ,           },  // 0
{   0,                  65535,              0,              0x0040, 953 ,           },  // 1
{   0,                  65535,              0,              0x0040, 954 ,           },  // 2
{   0,                  65535,              0,              0x0040, 955 ,           },  // 3
{   0,                  65535,              0,              0x0040, 956 ,           },  // 4
{   0,                  65535,              0,              0x0040, 957 ,           },  // 5
{   0,                  65535,              0,              0x0040, 958 ,           },  // 6
{   0,                  65535,              0,              0x0040, 959 ,           },  // 7
{   0,                  65535,              0,              0x0040, 960 ,           },  // 8
{   0,                  65535,              0,              0x0040, 961 ,           },  // 9
{   0,                  65535,              0,              0x0040, 962 ,           },  // 10
{   0,                  65535,              0,              0x0040, 963 ,           },  // 11
{   0,                  65535,              0,              0x0040, 964 ,           },  // 12
{   0,                  65535,              0,              0x0040, 965 ,           },  // 13
{   0,                  65535,              0,              0x0040, 966 ,           },  // 14
{   0,                  65535,              0,              0x0040, 967 ,           },  // 15
{   0,                  65535,              0,              0x0040, 968 ,           },  // 16
{   0,                  65535,              0,              0x0040, 969 ,           },  // 17
{   0,                  65535,              0,              0x0040, 970 ,           },  // 18
{   0,                  65535,              0,              0x0040, 971 ,           },  // 19
{   0,                  65535,              0,              0x0040, 972 ,           },  // 20
{   0,                  65535,              0,              0x0040, 973 ,           },  // 21
{   0,                  65535,              0,              0x0040, 974 ,           },  // 22
{   0,                  65535,              0,              0x0040, 975 ,           },  // 23
{   0,                  65535,              0,              0x0040, 976 ,           },  // 24
{   0,                  65535,              0,              0x0040, 977 ,           },  // 25
{   0,                  65535,              0,              0x0040, 978 ,           },  // 26
{   0,                  65535,              0,              0x0040, 979 ,           },  // 27
{   0,                  65535,              0,              0x0040, 980 ,           },  // 28
{   0,                  65535,              0,              0x0040, 981 ,           },  // 29

//  AA 下限             AA 上限             AA 出厂值       AA 属性 AA-EEPROM地址
{   0,                  65535,                  0,              0x0940, 404,            },  // 0

//  AB 下限             AB 上限             AB 出厂值       AB 属性 AB-EEPROM地址
{   0,                   1500,           1200,              0x010A, 574 ,           },  // 0  

//  AC 下限             AC 上限             AC 出厂值       AC 属性 AC-EEPROM地址     
{    500,               4000,               2000,           0x2163, 488 ,           },  // 0 AI1
{    500,               4000,               2000,           0x2163, 489 ,           },  // 1
{   6000,               9999,               8000,           0x2163, 490 ,           },  // 2
{   6000,               9999,               8000,           0x2163, 491 ,           },  // 3
{    500,               4000,               2000,           0x2163, 492 ,           },  // 4 AI2
{    500,               4000,               2000,           0x2163, 493 ,           },  // 5
{   6000,               9999,               8000,           0x2163, 494 ,           },  // 6
{   6000,               9999,               8000,           0x2163, 495 ,           },  // 7
{  (Uint16)(-9999),    10000,               2000,           0x2163, 496 ,           },  // 8 AI3
{  (Uint16)(-9999),    10000,               2000,           0x2163, 497 ,           },  // 9
{  (Uint16)(-9999),    10000,               8000,           0x2163, 498 ,           },  // 10
{  (Uint16)(-9999),    10000,               8000,           0x2163, 499 ,           },  // 11
{    500,               4000,               2000,           0x2163, 500 ,           },  // 12 AO1 
{    500,               4000,               2000,           0x2163, 501 ,           },  // 13
{   6000,               9999,               8000,           0x2163, 502 ,           },  // 14
{   6000,               9999,               8000,           0x2163, 503 ,           },  // 15
{    500,               4000,               2000,           0x2163, 504 ,           },  // 16 AO2
{    500,               4000,               2000,           0x2163, 505 ,           },  // 17
{   6000,               9999,               8000,           0x2163, 506 ,           },  // 18
{   6000,               9999,               8000,           0x2163, 507 ,           },  // 19                                                                       
                                                                     
//  AD 下限             AD 上限             AD 出厂值       AD 属性 AD-EEPROM地址     
{   0,                  65535,              0,              0x0140, 536 ,           },  // 0
                                                                   
//  AE 下限             AE 上限             AE 出厂值       AE 属性 AE-EEPROM地址     
{    500,               4000,               2000 ,           0x2163, 537 ,           },  // 0 AI1
{    500,               4000,               2000 ,           0x2163, 538 ,           },  // 1
{   6000,               9999,               8000 ,           0x2163, 539 ,           },  // 2
{   6000,               9999,               8000 ,           0x2163, 540 ,           },  // 3
{    500,               4000,               2000 ,           0x2163, 541 ,           },  // 4 AI2
{    500,               4000,               2000 ,           0x2163, 542 ,           },  // 5
{   6000,               9999,               8000 ,           0x2163, 543 ,           },  // 6
{   6000,               9999,               8000 ,           0x2163, 544 ,           },  // 7
{  (Uint16)(-9999),    10000,               2000 ,           0x2163, 545 ,           },  // 8 AI3
{  (Uint16)(-9999),    10000,               2000 ,           0x2163, 546 ,           },  // 9
{  (Uint16)(-9999),    10000,               8000 ,           0x2163, 547 ,           },  // 10
{  (Uint16)(-9999),    10000,               8000 ,           0x2163, 548 ,           },  // 11
{    500,               4000,               2000 ,           0x2163, 549 ,           },  // 12 AO1
{    500,               4000,               2000 ,           0x2163, 550 ,           },  // 13
{   6000,               9999,               8000 ,           0x2163, 551 ,           },  // 14
{   6000,               9999,               8000 ,           0x2163, 552 ,           },  // 15
{    500,               4000,               2000 ,           0x2163, 553 ,           },  // 16 AO2
{    500,               4000,               2000 ,           0x2163, 554 ,           },  // 17
{   6000,               9999,               8000 ,           0x2163, 555 ,           },  // 18
{   6000,               9999,               8000 ,           0x2163, 556 ,           },  // 19
                                                                        
//  AF 下限             AF 上限             AF 出厂值       AF 属性 AF-EEPROM地址     
{     0,               65535,              1,              0x0140, 557 ,           },  // AF-00
                                                                        
//  B0 下限             B0 上限             B0 出厂值       B0 属性 B0-EEPROM地址     
{   0,                  65535,              0,              0x0140, 918 ,           },  //
                                                                        
//  B1 下限             B1 上限             B1 出厂值       B1 属性 B1-EEPROM地址     
{   0,                  65535,              0,              0x0140, 919 ,           },  //
                                                                        
//  B2 下限             B2 上限             B2 出厂值       B2 属性 B2-EEPROM地址     
{   0,                  65535,              0,              0x0140, 920 ,           },  //

//  B3 下限             B3 上限             B3 出厂值       B3 属性 B3-EEPROM地址     
{   0,                  65535,              0,              0x0140, 705 ,           },  //
                                                                        
//  B4 下限             B4 上限             B4 出厂值       B4 属性 B4-EEPROM地址     
{   0,                  65535,              0,              0x0140, 706 ,           },  //
                                                                        
//  B5 下限             B5 上限             B5 出厂值       B5 属性 B5-EEPROM地址     
{   0,                  65535,              0,              0x0140, 707 ,           },  //
                                                                        
//  B6 下限             B6 上限             B6 出厂值       B6 属性 B6-EEPROM地址     
{   0,                  65535,              0,              0x0140, 708 ,           },  //
                                                                        
//  B7 下限             B7 上限             B7 出厂值       B7 属性 B7-EEPROM地址     
{   0,                  65535,              0,              0x0140, 709 ,           },  //
                                                                        
//  B8 下限             B8 上限             B8 出厂值       B8 属性 B8-EEPROM地址     
{   0,                  65535,              0,              0x0140, 710 ,           },  //
                                                                        
//  B9 下限             B9 上限             B9 出厂值       B9 属性 B9-EEPROM地址     
{   0,                  65535,              0,              0x0140, 711 ,           },  //
                                                                        
//  BA 下限             BA 上限             BA 出厂值       BA 属性 BA-EEPROM地址     
{   0,                  65535,              0,              0x0140, 712 ,           },  //
                                                                        
//  BB 下限             BB 上限             BB 出厂值       BB 属性 BB-EEPROM地址     
{   0,                  65535,              0,              0x0140, 713 ,           },  //
                                                                        
//  BC 下限             BC 上限             BC 出厂值       BC 属性 BC-EEPROM地址     
{   0,                  65535,              0,              0x0140, 714 ,           },  //
                                                                        
//  BD 下限             BD 上限             BD 出厂值       BD 属性 BD-EEPROM地址     
{   0,                  65535,              0,              0x0140, 715 ,           },  //
                                                                        
//  BE 下限             BE 上限             BE 出厂值       BE 属性 BE-EEPROM地址     
{   0,                  65535,              0,              0x0140, 716 ,           },  //
                                                                        
//  BF 下限             BF 上限             BF 出厂值       BF 属性 BF-EEPROM地址     
{   0,                  65535,              0,              0x0140, 717 ,           },  //
                                                                                                                                               
//  C0 下限             C0 上限             C0 出厂值       C0 属性 C0-EEPROM地址     
{   0,                  65535,              0,              0x0140, 718 ,           },  // 
                                                                        
//  C1 下限             C1 上限             C1 出厂值       C1 属性 C1-EEPROM地址     
{   0,                  65535,              0,              0x0140, 719 ,           },  
                                                                        
//  C2 下限             C2 上限             C2 出厂值       C2 属性 C2-EEPROM地址     
{   0,                  65535,              0,              0x0140, 720 ,           },  
                                                                        
//  C3 下限             C3 上限             C3 出厂值       C3 属性 C3-EEPROM地址     
{   0,                  65535,              0,              0x0140, 721 ,           },  
                                                                        
//  C4 下限             C4 上限             C4 出厂值       C4 属性 C4-EEPROM地址     
{   0,                  65535,              0,              0x0140, 722 ,           },  
                                                                        
//  C5 下限             C5 上限             C5 出厂值       C5 属性 C5-EEPROM地址     
{   0,                  65535,              0,              0x0140, 723 ,           },  // 5
                                                                        
//  C6 下限             C6 上限             C6 出厂值       C6 属性 C6-EEPROM地址  
{   0,                  65535,              0,              0x0140, 724 ,           },  
                                                                        
//  C7 下限             C7 上限             C7 出厂值       C7 属性 C7-EEPROM地址     
{   0,                  65535,              0,              0x0140, 725 ,           },  
                                                                        
//  C8 下限             C8 上限             C8 出厂值       C8 属性 C8-EEPROM地址     
{   0,                  65535,              0,              0x0140, 726 ,           },  
                                                                        
//  C9 下限             C9 上限             C9 出厂值       C9 属性 C9-EEPROM地址     
{   0,                  65535,              0,              0x0140, 727 ,           },  
                                                                        
//  CA 下限             CA 上限             CA 出厂值       CA 属性 CA-EEPROM地址     
{   0,                  65535,              0,              0x0140, 728 ,           },  
                                                                        
//  CB 下限             CB 上限             CB 出厂值       CB 属性 CB-EEPROM地址     
{   0,                  65535,              0,              0x0140, 729 ,           },  

//  CC 下限             CC 上限             CC 出厂值       CC 属性 CC-EEPROM地址
{   0,                  1  ,                0,              0x0140, 365 ,           },  // FE-00   运行中点动使能
                                                                        
//  CD 下限             CD 上限             CD 出厂值       CD 属性 CD-EEPROM地址     
{   0,                  65535,              0,              0x0140, 762 ,           },  //
                                                                        
//  CE 下限             CE 上限             CE 出厂值       CE 属性 CE-EEPROM地址     
{   0,                  65535,              0,              0x0140, 763 ,           },  // 0
                                                                        
//  CF 下限             CF 上限             CF 出厂值       CF 属性 CF-EEPROM地址     
{   0,                  65535,              0,              0x0140, 764 ,           },  // 0
#if DEBUG_F_MOTOR_FUNCCODE                                                
{   0,                  65535,              0,              0x0140, 765 ,           },  // CF-01
{   0,                  200,                100,            0x0170, 766 ,           },  // CF-02 磁通观测补偿系数     0%-200%      100%
{   100,                2000,               500,            0x0140, 767 ,           },  // CF-03 磁通观测滤波系数     100-2000     300
{   0,                  500,                200,            0x0140, 768 ,           },  // CF-04 M轴电流闭环系数      0-500        200
{   0,                  500,                0,              0x0140, 769 ,           },  // CF-05 T轴电流闭环系数      0-500        0
{   0,                  500,                100,            0x00F1, 770 ,           },  // CF-06 SVC转矩提升          0.0%-50.0%   10.0%
{   0,                  RATING_FRQ_INDEX,   2000,           0x0B4A, 771 ,           },  // CF-07 SVC转矩提升截止频率  0-额定频率   20.00Hz
{   0,                  31,                 28,             0x0140, 772 ,           },  // CF-08 T轴电流滤波系数
{   0,                  65535,              0,              0x0140, 773 ,           },  
{   0,                  65535,              0,              0x0140, 774 ,           },  // 10
{   1,                  1000,               100,            0x0140, 775 ,           },  // 11
{   0,                  65535,              0,              0x0140, 776 ,           },  
{   0,                  65535,              0,              0x0140, 777 ,           },  
{   0,                  65535,              0,              0x0140, 778 ,           },  
{   0,                  65535,              0,              0x0140, 779 ,           },  // 15
{   0,                  65535,              0,              0x0140, 780 ,           },  
{   0,                  65535,              0,              0x0140, 781 ,           },  
{   0,                  65535,              0,              0x0140, 782 ,           },  
{   0,                  65535,              0,              0x0140, 783 ,           },  
{   0,                  65535,              0,              0x0140, 784 ,           },  // 20
{   0,                  65535,              0,              0x0140, 785 ,           },  
{   0,                  65535,              0,              0x0140, 786 ,           },  
{   0,                  65535,              0,              0x0140, 787 ,           },  
{   0,                  65535,              0,              0x0140, 788 ,           },  
{   0,                  65535,              0,              0x0140, 789 ,           },  // 25
{   0,                  65535,              0,              0x0140, 790 ,           },  
{   0,                  65535,              0,              0x0140, 791 ,           },  
{   0,                  65535,              0,              0x0140, 792 ,           },
{   0,                  65535,              0,              0x0140, 793 ,           },       
{   0,                  65535,              0,              0x0140, 794 ,           },  // 30
{   0,                  65535,              0,              0x0140, 795 ,           },       
{   0,                  65535,              0,              0x0140, 796 ,           },       
{   0,                  65535,              0,              0x0140, 797 ,           },       
{   0,                  65535,              0,              0x0140, 798 ,           },       
{   0,                  65535,              0,              0x0140, 799 ,           },  // 35
{   0,                  65535,              0,              0x0140, 800 ,           },       
{   0,                  65535,              0,              0x0140, 801 ,           },       
{   0,                  65535,              0,              0x0140, 802 ,           },       
{   0,                  65535,              0,              0x0140, 803 ,           },   
#endif

};



// fChk，remember对应的EEPROM index  
// 请按照功能码union的顺序排列
const Uint16 fcNoAttri2Eeprom[CHK_NUM + REM_NUM] =                                               
{
// 保留
    0 ,     // rsvd4All
    1 ,     // fChk-EEPROM地址
    2 ,     // 
    3 ,     // AIAO_CHK
    
// remember-EEPROM地址
    16  ,   // 0                                             
    17  ,   // 1                                           
    18  ,   // 2                                           
    19  ,   // 3                                           
    20  ,   // 4  
    21  ,   // 5                                            
    22  ,   // 6                                           
    23  ,   // 7                                           
    24  ,   // 8                                           
    25  ,   // 9  
    26  ,   // 10                                           
    27  ,   // 11                                          
    28  ,   // 12                                          
    29  ,   // 13                                          
    30  ,   // 14                                          
    31  ,   // 15 
    32  ,   // 16 
    33  ,   // 17 
    34  ,   // 18 
    35  ,   // 19 
    36  ,   // 20 
    37  ,   // 21 
    38  ,   // 22 
    39  ,   // 23 
    40  ,   // 24 
    41  ,   // 25
    42  ,   // 26
    43  ,   // 27
    44  ,   // 28
    45  ,   // 29
    46  ,   // 30
    47  ,   // 31
    48  ,   // 32
    49  ,   // 33
    50  ,   // 34
    51  ,   // 35
    52  ,   // 36
    53  ,   // 37
    54  ,   // 38
    55  ,   // 39
    56  ,   // 40
    57  ,   // 41
    58  ,   // 42
    59  ,   // 43
    60  ,   // 44
    61  ,   // 45
    62  ,   // 46
    63  ,   // 47

};  



